app/controllers/points_controller.rb

  def index
    @q = Point.ransack(params[:q])
    @points = @q.result.page(params[:page]).per(5)
---
SELECT "points".* FROM "points" WHERE ('sentido')
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "points" LIMIT 5 OFFSET 0) subquery_for_count

  def destroy
    @point.destroy
---
DELETE FROM "points" WHERE "points"."id" = ?  [["id", 1]]

    def set_point
      @point = Point.find(params[:id])
---
SELECT "points".* FROM "points" WHERE "points"."id" = ? LIMIT 1  [["id", :sentido]]